2019.07.09.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-09 Tue 14:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="http://alan.petitepomme.net/cwn/2019.07.02.html">Previous Week</a> <a href="http://alan.petitepomme.net/cwn/index.html">Up</a> <a href="http://alan.petitepomme.net/cwn/2019.07.16.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of July 02 to 09, 2019.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#1">ppx_show: a show deriver based of ppxlib (works on 4.08.0)</a></li>
<li><a href="#2">Library for GUI?</a></li>
<li><a href="#3">XMPP room (muc) for OCaml</a></li>
<li><a href="#4">obus 1.2.0</a></li>
<li><a href="#5">PSA: ocaml/opam2 docker images updated to 4.08.0 release</a></li>
<li><a href="#6">Other OCaml News</a></li>
<li><a href="#org79550e4">Old CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgb984758" class="outline-2">
<h2 id="1">ppx_show: a show deriver based of ppxlib (works on 4.08.0)</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-ppx-show-a-show-deriver-based-of-ppxlib-works-on-4-08-0/4026/1">https://discuss.ocaml.org/t/ann-ppx-show-a-show-deriver-based-of-ppxlib-works-on-4-08-0/4026/1</a>
</p>
</div>

<div id="outline-container-org5ecda7f" class="outline-3">
<h3 id="org5ecda7f">Thierry Martinez announced</h3>
<div class="outline-text-3" id="text-org5ecda7f">
<p>
I am pleased to announce that <code>ppx_show</code> is now available in opam. <code>ppx_show</code> reimplements the <code>show</code> plugin provided by <a href="https://github.com/ocaml-ppx/ppx_deriving"><code>ppx_deriving</code></a> as a <a href="https://github.com/ocaml-ppx/ppxlib"><code>ppxlib</code></a> plugin. In particular, <code>ppx_show</code> is available with OCaml 4.08.0 (and is available on all OCaml versions compatible with <code>ppxlib</code>, starting from 4.04.1).
</p>

<p>
<a href="https://gitlab.inria.fr/tmartine/ppx_show/">https://gitlab.inria.fr/tmartine/ppx_show/</a>
</p>

<p>
See @arbipher's <a href="https://discuss.ocaml.org/t/is-there-plugin-show-based-on-ppxlib-deriving/3080/2">related question</a>.
</p>
</div>
</div>
</div>




<div id="outline-container-orgf67bb5e" class="outline-2">
<h2 id="2">Library for GUI?</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/library-for-gui/648/45">https://discuss.ocaml.org/t/library-for-gui/648/45</a>
</p>
</div>

<div id="outline-container-orgd2ee2e7" class="outline-3">
<h3 id="orgd2ee2e7">Deep in this thread, sanette announced</h3>
<div class="outline-text-3" id="text-orgd2ee2e7">
<p>
In the last few years I have been developing a GUI for (and in) ocaml, as a hobby project.
Finally, I have made the current state of this thing (called "<b>bogue</b>") available on github, see
</p>

<p>
<a href="https://github.com/sanette/bogue">https://github.com/sanette/bogue</a>
</p>

<p>
Just in case some of you are interested in having a look.
Comments welcome, of course.
</p>
</div>
</div>


<div id="outline-container-orgdf9d25a" class="outline-3">
<h3 id="orgdf9d25a">sanette later added</h3>
<div class="outline-text-3" id="text-orgdf9d25a">
<p>
I just made a video to show some of <b>bogue</b>'s features:
</p>

<p>
<a href="https://youtu.be/isFLxnDooL8">https://youtu.be/isFLxnDooL8</a>
</p>
</div>
</div>
</div>




<div id="outline-container-org675d991" class="outline-2">
<h2 id="3">XMPP room (muc) for OCaml</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/xmpp-room-muc-for-ocaml/4039/1">https://discuss.ocaml.org/t/xmpp-room-muc-for-ocaml/4039/1</a>
</p>
</div>

<div id="outline-container-org404eda0" class="outline-3">
<h3 id="org404eda0">Orbifx announced</h3>
<div class="outline-text-3" id="text-org404eda0">
<p>
I'm not aware of any other XMPP rooms for OCaml, so I've made one:
</p>

<p>
&lt;xmpp:ocaml@conference.orbitalfox.eu?join&gt;
</p>

<p>
Come join if you want to hang out with OCamlers.
</p>

<p>
Ideas &amp; thoughts are welcome!
</p>
</div>
</div>
</div>




<div id="outline-container-org58132fa" class="outline-2">
<h2 id="4">obus 1.2.0</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-obus-1-2-0/4038/1">https://discuss.ocaml.org/t/ann-obus-1-2-0/4038/1</a>
</p>
</div>

<div id="outline-container-org5af35bd" class="outline-3">
<h3 id="org5af35bd">Freyr666 announced</h3>
<div class="outline-text-3" id="text-org5af35bd">
<p>
I'm pleased to announce a new <code>obus</code> release.
</p>
</div>

<div id="outline-container-orgff46552" class="outline-4">
<h4 id="orgff46552">What is obus</h4>
<div class="outline-text-4" id="text-orgff46552">
<p>
A pure OCaml implementation of the D-Bus IPC protocol, heavily used in Freedesktop/linux world [1].
</p>
</div>
</div>

<div id="outline-container-org5f8f7c3" class="outline-4">
<h4 id="org5f8f7c3">Notable changes</h4>
<div class="outline-text-4" id="text-org5f8f7c3">
<ul class="org-ul">
<li><code>obus</code> is being transitioned to <code>ocaml-community</code></li>
<li>switched to <code>dune</code></li>
<li><code>camlp4</code> parts were replaced with <code>menhir</code></li>
<li><code>camlp4</code> syntax extension was replaced with the <code>ppx</code>-based ones</li>
</ul>

<p>
This release shouldn't break anything (safe for the syntax extension).
</p>

<p>
Special thanks to @steinuil and @pukkamustard for doing most of the "dunification" work.
</p>
</div>
</div>

<div id="outline-container-orged8b694" class="outline-4">
<h4 id="orged8b694">Thoughts about the future</h4>
<div class="outline-text-4" id="text-orged8b694">
<p>
So after pondering on obus refactoring I came to the following ideas, which I would like to discuss:
</p>

<ol class="org-ol">
<li><p>
<code>IDL</code>, an intermediate language used for the D-Bus interfaces' description doesn't worth the effort and is better to be dropped.
</p>

<p>
D-Bus uses XML for such a purpose and there is no merit in having an additional language doing the same (with minor improvements like not being XML-abomination and the ability to define numeric types as OCaml variants). It makes sense to generate OCaml files from the XML directly and don't use any obus-specific additional language.
</p></li>

<li><p>
<code>ppx</code> syntax extensions could also be dropped since they don't do much stuff. Also I haven't seen anybody using them, but I could be wrong.
</p>

<p>
So it's better to either improve it (maybe turn IDL language into simple <code>ppx</code> annotations) or drop it completely. Personally, I like the idea of not using <code>ppx</code> because they are slowing things down making the project lag behind ocaml releases, and making things fragile in general.
</p></li>

<li>obus should be split into proper subpackages, like <code>obus</code>, <code>obus-network-manager</code>, <code>obus-notifications</code> etc</li>
</ol>

<p>
So since it's a community project from now on, it would be great to hear what obus users and contributors are thinking about all forementioned. cast @diml @talex5 @perry @johnelse
</p>

<p>
[1] <a href="https://www.freedesktop.org/wiki/Software/dbus/">https://www.freedesktop.org/wiki/Software/dbus/</a>
</p>
</div>
</div>
</div>
</div>




<div id="outline-container-orgcd44994" class="outline-2">
<h2 id="5">PSA: ocaml/opam2 docker images updated to 4.08.0 release</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/psa-ocaml-opam2-docker-images-updated-to-4-08-0-release/3948/2">https://discuss.ocaml.org/t/psa-ocaml-opam2-docker-images-updated-to-4-08-0-release/3948/2</a>
</p>
</div>

<div id="outline-container-orgb7fec45" class="outline-3">
<h3 id="orgb7fec45">Anil Madhavapeddy announced</h3>
<div class="outline-text-3" id="text-orgb7fec45">
<p>
Another update: the base distributions of the ocaml/opam2 images have also been updated to support Fedora 30, Alpine 3.10, OpenSUSE Leap 42.1 and also the impending Debian 10 (Buster) release.  We have also deprecated Fedora 27/28, Ubuntu 14.04 and Alpine 3.8 in favour of the newer releases.   The 4.09 switches also reflect the recently released 4.09+beta1 snapshot.
</p>

<p>
There have been a few requests for 'slimmer' images that use up less disk-space. The reason the existing ones are so big is that each container has multiple precompiled compilers (either multiple major releases, or feature variants such as flambda or afl).  This is really useful for continuous integration, but is less ideal if you just want a quick OCaml compiler container to build some software on your QubesOS laptop.
</p>

<p>
In order to accommodate both usecases, I'm going to resurrect the <code>ocaml/opam</code> containers for the "slim" usecase.  The containers in <code>ocaml/opam</code> are currently deprecated while we did the opam2 release, but now that is out of the way we can remove the opam1 containers.  Over the next few months, we'll have <code>ocaml/opam</code> containers with minimally sized toolchains for production compilation use, and the <code>ocaml/opam2</code> containers will continue to be maintained unchanged for CI use.
</p>

<p>
As always, more feedback or usecases welcome to help guide the evolution of this infrastructure.
</p>
</div>
</div>
</div>




<div id="outline-container-orgadd4377" class="outline-2">
<h2 id="6">Other OCaml News</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgb77d5fd" class="outline-3">
<h3 id="orgb77d5fd">From the ocamlcore planet blog</h3>
<div class="outline-text-3" id="text-orgb77d5fd">
<p>
Here are links from many OCaml blogs aggregated at <a href="http://ocaml.org/community/planet/">OCaml Planet</a>.
</p>

<ul class="org-ul">
<li><a href="https://tarides.com/blog/2019-07-05-i-lab-2019.html">i-Lab 2019</a></li>
<li><a href="http://math.andrej.com/2019/07/04/what-is-an-explicit-bijection-fpsac-2019-slides/">What is an explicit bijection? (FPSAC 2019 slides)</a></li>
<li><a href="https://tarides.com/blog/2019-06-27-release-of-ocamlformat-0-10.html">Release of OCamlFormat 0.10</a></li>
</ul>
</div>
</div>
</div>




<div id="outline-container-org79550e4" class="outline-2">
<h2 id="org79550e4">Old CWN</h2>
<div class="outline-text-2" id="text-org79550e4">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="http://alan.petitepomme.net/cwn/">the archive</a> or the <a href="http://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe <a href="http://lists.idyll.org/listinfo/caml-news-weekly/">online</a>.
</p>

<div class="authorname">
<p>
<a href="http://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
